ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/api_setPromotionalSale_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
	<soapenv:Header>
		<ebl:RequesterCredentials>
			<ebl:eBayAuthToken>%s(authToken)</ebl:eBayAuthToken>
		</ebl:RequesterCredentials>
	</soapenv:Header>
	<soapenv:Body>
		<ebl:SetPromotionalSaleRequest>
			<ebl:Version>%s(version)</ebl:Version>
			<ebl:Action>INVALID</ebl:Action>
			<ebl:PromotionalSaleDetails>
				<ebl:PromotionalSaleID>1112</ebl:PromotionalSaleID>
				<ebl:PromotionalSaleName>Promotional Name</ebl:PromotionalSaleName>
				<ebl:DiscountType>Percentage</ebl:DiscountType>
				<ebl:DiscountValue>10</ebl:DiscountValue>
				<ebl:PromotionalSaleStartTime>%s(PromotionalSaleStartTime)</ebl:PromotionalSaleStartTime>
				<ebl:PromotionalSaleEndTime>%s(PromotionalSaleEndTime)</ebl:PromotionalSaleEndTime>
				<ebl:PromotionalSaleType>PriceDiscountOnly</ebl:PromotionalSaleType>
			</ebl:PromotionalSaleDetails>
		</ebl:SetPromotionalSaleRequest>
	</soapenv:Body>
</soapenv:Envelope>